&НаСервере
Процедура ОбработатьДокументПродажи(ДокСсылка,НачПериода,НормаПродаж)
	
	обДок = ДокСсылка.ПолучитьОбъект();
	
	//обДок = Документы.Продажа.СоздатьДокумент();
	
	обДок.Движения.ПартииТоваров.Записать();
	обДок.Движения.Продажи.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПродажиОбороты.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачДата, &МомВремени, , ДокументПродажи.Сотрудник = &Сотрудник) КАК ПродажиОбороты";
	
	Запрос.УстановитьПараметр("НачДата", НачПериода);
	Запрос.УстановитьПараметр("МомВремени", обДок.МоментВремени());
	Запрос.УстановитьПараметр("Сотрудник", обДок.Сотрудник);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ОбщСуммаПродаж = 0;
	Если Выборка.Следующий() Тогда
		ОбщСуммаПродаж = Выборка.СуммаОборот;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ПродажаТовары.Количество) КАК Количество,
	               |	СУММА(ПродажаТовары.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ТоварыПродажи
	               |ИЗ
	               |	Документ.Продажа.Товары КАК ПродажаТовары
	               |ГДЕ
	               |	ПродажаТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажаТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Партия КАК Партия,
	               |	СУММА(ВложенныйЗапрос.КоличествоДок) КАК КоличествоДок,
	               |	СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток,
	               |	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК СуммаОстаток,
	               |	СУММА(ВложенныйЗапрос.СуммаДок) КАК СуммаДок
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТоварыПродажи.Номенклатура КАК Номенклатура,
	               |		ЗНАЧЕНИЕ(Документ.Покупка.ПустаяСсылка) КАК Партия,
	               |		ТоварыПродажи.Количество КАК КоличествоДок,
	               |		0 КАК КоличествоОстаток,
	               |		0 КАК СуммаОстаток,
	               |		ТоварыПродажи.Сумма КАК СуммаДок
	               |	ИЗ
	               |		ТоварыПродажи КАК ТоварыПродажи
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПартииТоваровОстатки.Номенклатура,
	               |		ПартииТоваровОстатки.Партия,
	               |		0,
	               |		ПартииТоваровОстатки.КоличествоОстаток,
	               |		ПартииТоваровОстатки.СуммаОстаток,
	               |		0
	               |	ИЗ
	               |		РегистрНакопления.ПартииТоваров.Остатки(
	               |				&МомВремени,
	               |				Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ТоварыПродажи.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						ТоварыПродажи КАК ТоварыПродажи)) КАК ПартииТоваровОстатки) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Партия
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Партия
	               |ИТОГИ
	               |	СУММА(КоличествоДок),
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток),
	               |	СУММА(СуммаДок)
	               |ПО
	               |	Номенклатура,
	               |	Партия
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("МомВремени", обДок.МоментВремени());
	
	Результат = Запрос.Выполнить();
	ВыборкаНомеклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	обДок.Движения.ПартииТоваров.Записывать = Истина;
	обДок.Движения.Продажи.Записывать 		= Истина;
	
	Пока ВыборкаНомеклатура.Следующий() Цикл
		текНом 		= ВыборкаНомеклатура.Номенклатура;
		КолДок 		= ВыборкаНомеклатура.КоличествоДок;
		КолОст 		= ВыборкаНомеклатура.КоличествоОстаток;
		СуммаДок 	= ВыборкаНомеклатура.СуммаДок;
		
		Нехватка = КолДок - КолОст;
		Если Нехватка>0 Тогда
			Сообщ = Новый СообщениеПользователю;
			Сообщ.Текст = "По номенклаатуре <" +текНом+ "> не хватает остатка " + Нехватка;
		КонецЕсли;
		
		ОсталосьСписать = КолДок;
		
		Себестоимость = 0;
		ВыборкаПартии = ВыборкаНомеклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПартии.Следующий() Цикл
			Если ВыборкаПартии.КоличествоОстаток>0 Тогда
				текПартия = ВыборкаПартии.Партия;
				КолСписать = мин(ОсталосьСписать, ВыборкаПартии.КоличествоОстаток);
				СуммаСписать = ?(КолСписать=ВыборкаПартии.КоличествоОстаток,ВыборкаПартии.СуммаОстаток,ВыборкаПартии.СуммаОстаток*КолСписать/ВыборкаПартии.КоличествоОстаток);
				
				ПартииТоваровЗапись = обДок.Движения.ПартииТоваров.Добавить();
				ПартииТоваровЗапись.ВидДвижения		= ВидДвиженияНакопления.Расход;
				ПартииТоваровЗапись.Период			= обДок.Дата;
				ПартииТоваровЗапись.Номенклатура 	= текНом;
				ПартииТоваровЗапись.Партия 			= текПартия;
				ПартииТоваровЗапись.Количество 		= КолСписать;
				ПартииТоваровЗапись.Сумма 			= СуммаСписать;
				
				Себестоимость = Себестоимость + СуммаСписать;
				
				ОсталосьСписать = ОсталосьСписать -  КолСписать;
			КонецЕсли;
		КонецЦикла;
		
		ПродажиЗапись 						= обДок.Движения.Продажи.Добавить();
		ПродажиЗапись.Период 				= обДок.Дата;
		ПродажиЗапись.Номенклатура 			= текНом;
		ПродажиЗапись.ДокументПродажи 		= ДокСсылка;
		ПродажиЗапись.Количество 			= КолДок;
		ПродажиЗапись.Сумма 				= СуммаДок;
		ПродажиЗапись.Себестоимость			= Себестоимость;
		
		ПревышНормы = ОбщСуммаПродаж + СуммаДок - НормаПродаж;
		
		ПревышениеКзаписи = мин(ПревышНормы,СуммаДок);
		
		Если ПревышениеКзАписи>0 Тогда
			ПродажиЗапись.ПревышениеНормы			= ПревышениеКзаписи;
		КонецЕсли;
		
		ОбщСуммаПродаж = ОбщСуммаПродаж + СуммаДок;
	КонецЦикла;
	обДок.Движения.ПартииТоваров.Записать();
	обДок.Движения.Продажи.Записать();
	
КонецПроцедуры	


&НаСервере
Процедура комВыполнитьСервер()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продажа.Ссылка КАК Ссылка,
		|	Продажа.Проведен КАК Проведен,
		|	Продажа.Дата КАК Дата
		|ИЗ
		|	Документ.Продажа КАК Продажа
		|ГДЕ
		|	Продажа.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И Продажа.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(Объект.НачДата));
	Запрос.УстановитьПараметр("ДатаК", КонецДня(Объект.КонДата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НормаПродаж = Константы.НормаПродаж.Получить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбработатьДокументПродажи(ВыборкаДетальныеЗаписи.Ссылка,НачалоДня(Объект.НачДата),НормаПродаж);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура комВыполнить(Команда)
	комВыполнитьСервер();
КонецПроцедуры
