
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Движения.ПартииТоваров.Записать();
	Движения.Продажи.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ПродажаТовары.Количество) КАК Количество,
	               |	ПродажаТовары.Сумма КАК Сумма
	               |ПОМЕСТИТЬ ТоварыПродажи
	               |ИЗ
	               |	Документ.Продажа.Товары КАК ПродажаТовары
	               |ГДЕ
	               |	ПродажаТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажаТовары.Номенклатура,
	               |	ПродажаТовары.Сумма
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыПродажи.Номенклатура КАК Номенклатура,
	               |	ТоварыПродажи.Количество КАК Количество,
	               |	ЕСТЬNULL(ПартииТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ТоварыПродажи.Сумма КАК Сумма
	               |ИЗ
	               |	ТоварыПродажи КАК ТоварыПродажи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваров.Остатки(
	               |				&МомВремени,
	               |				Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ТоварыПродажи.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						ТоварыПродажи КАК ТоварыПродажи)) КАК ПартииТоваровОстатки
	               |		ПО ТоварыПродажи.Номенклатура = ПартииТоваровОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("МомВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Движения.ПартииТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		Нехватка = Выборка.Количество - Выборка.КоличествоОстаток;
		Если Нехватка>0 Тогда
			Сообщ = Новый СообщениеПользователю;
			Сообщ.Текст = "По номенклатуре '"+Выборка.Номенклатура+"' не хватает остатка " + Нехватка;
			//Предупреждение();
			//ВызватьИсключение Сообщ.Текст;
			Сообщ.Сообщить();
			Отказ=Истина;
			Продолжить;
		КонецЕсли;
		Движение = Движения.ПартииТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура 	= Выборка.Номенклатура;
		Движение.Количество 	= Выборка.Количество;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.ДокументПродажи 	= Ссылка;
		Движение.Количество 		= Выборка.Количество;
		Движение.Сумма 				= Выборка.Сумма;
	КонецЦикла;
	
	//// регистр ПартииТоваров Расход
	//Движения.ПартииТоваров.Записывать = Истина;
	//Для Каждого ТекСтрокаТовары Из Товары Цикл
	//	Движение = Движения.ПартииТоваров.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	//	Движение.Количество = ТекСтрокаТовары.Количество;
	//	Движение.Сумма = ТекСтрокаТовары.Сумма;
	//КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
