# encoding: utf-8
# language: ru

Функционал: Расчет возраста человека в месяцах
	Как Кадровик
	Хочу получить значение возраста человека в месяцах
	Чтобы подготовить отчет для руководства

Сценарий: расчет возраста человека в месяцах с датой рождения 05.01.1985 на дату 05.01.2017
	Допустим у меня есть значение даты рождения человека равное 05.01.1985
	и значение даты определения возраста в месяцах равное 05.01.2017
	Тогда результат расчета возраста в месяцах будет равен 384


Сценарий: расчет возраста человека в месяцах с датой рождения 25.07.1993 на дату 10.10.2017
	Допустим у меня есть значение даты рождения человека равное 25.07.1993
	и значение даты определения возраста в месяцах равное 10.10.2017
	Тогда результат расчета возраста в месяцах будет равен 290


Сценарий: расчет возраста человека в месяцах с датой рождения 12.02.1988 на дату 15.10.2017
	Допустим у меня есть значение даты рождения человека равное 12.02.1988
	и значение даты определения возраста в месяцах равное 15.10.2017
	Тогда результат расчета возраста в месяцах будет равен 6
