&НаСервере
Процедура комРассчетСервер()
	масСотрудников = Объект.Начисления.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПродажиОбороты.ДокументПродажи.Сотрудник КАК Сотрудник,
	|	ПродажиОбороты.ПревышениеНормыОборот КАК ПревышениеНормыПродаж
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачПериод, &КонПериод, , ДокументПродажи.Сотрудник В (&МасСотрудников)) КАК ПродажиОбороты";
	
	Запрос.УстановитьПараметр("НачПериод", НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("КонПериод", КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("МасСотрудников", масСотрудников);
	
	Результат = Запрос.Выполнить();
	
	ЕстьПревышениеНорм = Ложь;
	Если не Результат.Пустой() Тогда
		ТЗПревышенийНормПродаж 	= Результат.Выгрузить();
		ЕстьПревышениеНорм 		= Истина;
	КонецЕсли;
	
	КтПремии = Константы.КоэффициентПремии.Получить();
	Для Каждого СтрНачисления из Объект.Начисления Цикл
		текСотрудник = СтрНачисления.Сотрудник;
		СтрНачисления.Оклад = текСотрудник.Оклад;
		Если ЕстьПревышениеНорм Тогда
			СтрПревышения = ТЗПревышенийНормПродаж.Найти(текСотрудник,"Сотрудник");
			Если СтрПревышения<>Неопределено Тогда
				СуммаПревышения = СтрПревышения.ПревышениеНормыПродаж;
				СтрНачисления.СуммаПремия = СуммаПревышения * КтПремии / 100;
			КонецЕсли;
		КонецЕсли;
		
		СтрНачисления.СуммаОклад = текСотрудник.Оклад * СтрНачисления.ДнейОтработано / Объект.НормаДней;
		
		СтрНачисления.СуммаИтог = СтрНачисления.СуммаОклад + СтрНачисления.СуммаПремия;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура комРассчет(Команда)
	комРассчетСервер()
КонецПроцедуры
